theblacktyper/stm32u5_custom_pcb_fw_zephyr/modules/stm32u5_dcmi/zephyr/video_stm32u5_dcmi.c
/*
 * Out-of-tree STM32U5 DCMI driver (GPDMA).
 * Compatible: st,stm32u5-dcmi. Use this so the in-tree video_stm32_dcmi.c
 * can stay unmodified; disable CONFIG_VIDEO_STM32_DCMI for the board.
 *
 * For frames larger than GPDMA_BNDT_MAX_BYTES, uses GPDMA linked-list mode
 * (multiple nodes per frame) so that e.g. 320x240 RGB565 can be captured.
 *
 * Based on Zephyr drivers/video/video_stm32_dcmi.c
 * Copyright (c) 2024 Charles Dias <charlesdias.cd@outlook.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32u5_dcmi

#include <errno.h>
#include <string.h>

#include <zephyr/kernel.h>
#include <zephyr/irq.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/video.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>

#include <stm32_ll_dma.h>

#include "video_device.h"

#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
#include <stm32u5xx_hal_dma_ex.h>
#endif

LOG_MODULE_REGISTER(video_stm32u5_dcmi, CONFIG_VIDEO_LOG_LEVEL);

#if CONFIG_VIDEO_BUFFER_POOL_NUM_MAX < 1
#error "The minimum required number of buffers for video_stm32u5_dcmi is 1"
#endif

/* GPDMA BNDT is 16-bit; max bytes per block. Use multiple of 4 for 32-bit xfer. */
#define GPDMA_BNDT_MAX_BYTES  65532U
#define DCMI_LLI_NODES_MAX    4

typedef void (*irq_config_func_t)(const struct device *dev);

struct stream {
	DMA_TypeDef *reg;
	const struct device *dma_dev;
	uint32_t channel;
	struct dma_config cfg;
};

struct video_stm32_dcmi_data {
	const struct device *dev;
	DCMI_HandleTypeDef hdcmi;
	struct video_format fmt;
	int capture_rate;
	struct k_fifo fifo_in;
	struct k_fifo fifo_out;
	struct video_buffer *vbuf;
#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
	bool capture_uses_lli;  /* true when current capture uses linked-list DMA */
#endif
};

struct video_stm32_dcmi_config {
	struct stm32_pclken pclken;
	irq_config_func_t irq_config;
	const struct pinctrl_dev_config *pctrl;
	const struct device *sensor_dev;
	const struct stream dma;
};

void HAL_DCMI_ErrorCallback(DCMI_HandleTypeDef *hdcmi)
{
	LOG_WRN("%s", __func__);
}

/* Shared frame-done handling: deliver filled buffer to app.
 * With 2+ buffers: deliver DMA buffer directly; return the other buffer to fifo_in
 * for the next capture (no memcpy - saves ~1-2 ms per frame).
 * With 1 buffer: fifo_in is empty; deliver the DMA buffer directly.
 */
static void dcmi_frame_done(struct video_stm32_dcmi_data *dev_data)
{
	struct video_buffer *vbuf = k_fifo_get(&dev_data->fifo_in, K_NO_WAIT);

	if (dev_data->vbuf != NULL) {
		/* Deliver DMA buffer directly (no copy). */
		dev_data->vbuf->timestamp = k_uptime_get_32();
		k_fifo_put(&dev_data->fifo_out, dev_data->vbuf);
		dev_data->vbuf = NULL;
	}
	if (vbuf != NULL) {
		/* Return the unused buffer to pool for next capture. */
		k_fifo_put(&dev_data->fifo_in, vbuf);
	}
}

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
{
	struct video_stm32_dcmi_data *dev_data =
			CONTAINER_OF(hdcmi, struct video_stm32_dcmi_data, hdcmi);

#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
	/* When using linked-list DMA, completion is signalled in the DMA callback. */
	if (dev_data->capture_uses_lli) {
		return;
	}
#endif

	/*
	 * With GPDMA (DMA_NORMAL) + DCMI_MODE_SNAPSHOT both the DMA and the
	 * DCMI have already stopped by the time this callback fires, so
	 * Suspend/Resume are unnecessary and would restart an unwanted capture.
	 */
	dcmi_frame_done(dev_data);
}

static void stm32_dcmi_isr(const struct device *dev)
{
	struct video_stm32_dcmi_data *data = dev->data;

	HAL_DCMI_IRQHandler(&data->hdcmi);
}

static void dcmi_dma_callback(const struct device *dev, void *arg, uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	ARG_UNUSED(dev);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d.", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}

void HAL_DMA_ErrorCallback(DMA_HandleTypeDef *hdma)
{
	LOG_WRN("%s", __func__);
}

#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
static struct video_stm32_dcmi_data *lli_owner;

static void dcmi_dma_lli_xfer_cplt(DMA_HandleTypeDef *hdma)
{
	struct video_stm32_dcmi_data *dev_data = lli_owner;

	if (dev_data == NULL) {
		return;
	}

	(void)HAL_DCMI_Stop(&dev_data->hdcmi);
	dcmi_frame_done(dev_data);
	dev_data->capture_uses_lli = false;
}
#endif

static int stm32_dma_init(const struct device *dev)
{
	struct video_stm32_dcmi_data *data = dev->data;
	const struct video_stm32_dcmi_config *config = dev->config;
	int ret;

	if (!device_is_ready(config->dma.dma_dev)) {
		LOG_ERR("%s DMA device not ready", config->dma.dma_dev->name);
		return -ENODEV;
	}

	struct dma_config dma_cfg = config->dma.cfg;
	static DMA_HandleTypeDef hdma;

	dma_cfg.user_data = &hdma;
	dma_cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;
	ret = dma_config(config->dma.dma_dev,
			config->dma.channel + STM32_DMA_STREAM_OFFSET, &dma_cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d",
			config->dma.channel + STM32_DMA_STREAM_OFFSET);
		return ret;
	}

	/* GPDMA (STM32U5) configuration */
	hdma.Init.Request		= dma_cfg.dma_slot;
	hdma.Init.Direction		= DMA_PERIPH_TO_MEMORY;
	hdma.Init.SrcInc		= DMA_SINC_FIXED;
	hdma.Init.DestInc		= DMA_DINC_INCREMENTED;
	hdma.Init.SrcDataWidth		= DMA_SRC_DATAWIDTH_WORD;
	hdma.Init.DestDataWidth		= DMA_DEST_DATAWIDTH_WORD;
	hdma.Init.SrcBurstLength	= 1;
	hdma.Init.DestBurstLength	= 1;
	hdma.Init.Priority		= DMA_HIGH_PRIORITY;
	hdma.Init.Mode			= DMA_NORMAL;
	hdma.Init.BlkHWRequest		= DMA_BREQ_SINGLE_BURST;
	hdma.Init.TransferAllocatedPort	= DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
	hdma.Init.TransferEventMode	= DMA_TCEM_BLOCK_TRANSFER;
	hdma.Instance = LL_DMA_GET_CHANNEL_INSTANCE(config->dma.reg,
						config->dma.channel);

	__HAL_LINKDMA(&data->hdcmi, DMA_Handle, hdma);

	if (HAL_DMA_Init(&hdma) != HAL_OK) {
		LOG_ERR("DCMI DMA Init failed");
		return -EIO;
	}

	return 0;
}

static int stm32_dcmi_enable_clock(const struct device *dev)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	const struct device *dcmi_clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (!device_is_ready(dcmi_clock)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	return clock_control_on(dcmi_clock, (clock_control_subsys_t *)&config->pclken);
}

static int video_stm32_dcmi_set_fmt(const struct device *dev, struct video_format *fmt)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	struct video_stm32_dcmi_data *data = dev->data;
	int ret;

	ret = video_set_format(config->sensor_dev, fmt);
	if (ret < 0) {
		return ret;
	}

	fmt->pitch = fmt->width * video_bits_per_pixel(fmt->pixelformat) / BITS_PER_BYTE;

	data->fmt = *fmt;

	return 0;
}

static int video_stm32_dcmi_get_fmt(const struct device *dev, struct video_format *fmt)
{
	struct video_stm32_dcmi_data *data = dev->data;
	const struct video_stm32_dcmi_config *config = dev->config;
	int ret;

	ret = video_get_format(config->sensor_dev, fmt);
	if (ret < 0) {
		return ret;
	}

	fmt->pitch = fmt->width * video_bits_per_pixel(fmt->pixelformat) / BITS_PER_BYTE;

	data->fmt = *fmt;

	return 0;
}

#define STM32_DCMI_GET_CAPTURE_RATE(capture_rate)					\
	((capture_rate) == 1 ? DCMI_CR_ALL_FRAME :					\
	(capture_rate) == 2 ? DCMI_CR_ALTERNATE_2_FRAME :				\
	(capture_rate) == 4 ? DCMI_CR_ALTERNATE_4_FRAME :				\
	DCMI_CR_ALL_FRAME)

static int video_stm32_dcmi_set_stream(const struct device *dev, bool enable,
				       enum video_buf_type type)
{
	struct video_stm32_dcmi_data *data = dev->data;
	const struct video_stm32_dcmi_config *config = dev->config;
	int err;

	if (!enable) {
		err = HAL_DCMI_Stop(&data->hdcmi);
		if (err != HAL_OK) {
			LOG_ERR("Failed to stop DCMI");
			return -EIO;
		}

		/* Only put back if still held (single-buffer path may have already delivered it). */
		if (data->vbuf != NULL) {
			k_fifo_put(&data->fifo_in, data->vbuf);
			data->vbuf = NULL;
		}

		return 0;
	}

	data->vbuf = k_fifo_get(&data->fifo_in, K_NO_WAIT);

	if (data->vbuf == NULL) {
		LOG_ERR("Failed to dequeue a DCMI buffer.");
		return -ENOMEM;
	}

	data->hdcmi.Instance->CR &= ~(DCMI_CR_FCRC_0 | DCMI_CR_FCRC_1);
	data->hdcmi.Instance->CR |= STM32_DCMI_GET_CAPTURE_RATE(data->capture_rate);

#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
	{
		const uint32_t buffer_size = data->vbuf->bytesused;

		if (buffer_size > GPDMA_BNDT_MAX_BYTES) {
			DMA_HandleTypeDef *hdma = data->hdcmi.DMA_Handle;
			const uint32_t dcmi_dr = (uint32_t)&(data->hdcmi.Instance->DR);
			uint32_t offset = 0U;
			uint32_t num_nodes = 0U;
			static DMA_NodeTypeDef lli_nodes[DCMI_LLI_NODES_MAX] __aligned(32);
			static DMA_QListTypeDef lli_queue;
			DMA_NodeConfTypeDef node_conf;

			data->capture_uses_lli = true;
			lli_owner = data;

			memset(&node_conf, 0, sizeof(node_conf));
			node_conf.NodeType = DMA_GPDMA_LINEAR_NODE;
			node_conf.Init = hdma->Init;
			node_conf.SrcAddress = dcmi_dr;

			memset(&lli_queue, 0, sizeof(lli_queue));
			hdma->LinkedListQueue = &lli_queue;

			hdma->InitLinkedList.Priority = hdma->Init.Priority;
			hdma->InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
			hdma->InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
			hdma->InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
			hdma->InitLinkedList.LinkedListMode = DMA_LINKEDLIST_NORMAL;

			if (HAL_DMAEx_List_Init(hdma) != HAL_OK) {
				LOG_ERR("Failed to init DMA linked-list");
				data->capture_uses_lli = false;
				return -EIO;
			}

			while (offset < buffer_size && num_nodes < DCMI_LLI_NODES_MAX) {
				uint32_t chunk = buffer_size - offset;

				if (chunk > GPDMA_BNDT_MAX_BYTES) {
					chunk = GPDMA_BNDT_MAX_BYTES;
				}
				node_conf.DstAddress = (uint32_t)data->vbuf->buffer + offset;
				node_conf.DataSize = chunk;

				if (HAL_DMAEx_List_BuildNode(&node_conf, &lli_nodes[num_nodes]) != HAL_OK) {
					LOG_ERR("Failed to build LLI node %u", num_nodes);
					data->capture_uses_lli = false;
					return -EIO;
				}
				if (num_nodes == 0U) {
					if (HAL_DMAEx_List_InsertNode_Head(&lli_queue, &lli_nodes[0]) != HAL_OK) {
						LOG_ERR("Failed to insert LLI head");
						data->capture_uses_lli = false;
						return -EIO;
					}
				} else {
					if (HAL_DMAEx_List_InsertNode(&lli_queue,
								&lli_nodes[num_nodes - 1U],
								&lli_nodes[num_nodes]) != HAL_OK) {
						LOG_ERR("Failed to insert LLI node %u", num_nodes);
						data->capture_uses_lli = false;
						return -EIO;
					}
				}
				offset += chunk;
				num_nodes++;
			}

			if (HAL_DMA_RegisterCallback(hdma, HAL_DMA_XFER_CPLT_CB_ID,
						     dcmi_dma_lli_xfer_cplt) != HAL_OK) {
				LOG_ERR("Failed to register LLI complete callback");
				data->capture_uses_lli = false;
				return -EIO;
			}

			if (HAL_DMAEx_List_Start_IT(hdma) != HAL_OK) {
				LOG_ERR("Failed to start DCMI DMA linked-list");
				data->capture_uses_lli = false;
				return -EIO;
			}

			__HAL_DCMI_ENABLE(&data->hdcmi);
			data->hdcmi.Instance->CR &= ~(DCMI_CR_CM);
			data->hdcmi.Instance->CR |= (uint32_t)(DCMI_MODE_SNAPSHOT);

			data->hdcmi.Instance->CR |= DCMI_CR_CAPTURE;
		} else
#endif
		{
			err = HAL_DCMI_Start_DMA(&data->hdcmi, DCMI_MODE_SNAPSHOT,
					(uint32_t)data->vbuf->buffer, data->vbuf->bytesused / 4);
			if (err != HAL_OK) {
				LOG_ERR("Failed to start DCMI DMA");
				return -EIO;
			}
		}
#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
	}
#endif
	return video_stream_start(config->sensor_dev, type);
}

static int video_stm32_dcmi_enqueue(const struct device *dev, struct video_buffer *vbuf)
{
	struct video_stm32_dcmi_data *data = dev->data;
	const uint32_t buffer_size = data->fmt.pitch * data->fmt.height;

	if (buffer_size > vbuf->size) {
		return -EINVAL;
	}

	vbuf->bytesused = buffer_size;
	vbuf->line_offset = 0;

	k_fifo_put(&data->fifo_in, vbuf);

	return 0;
}

static int video_stm32_dcmi_dequeue(const struct device *dev, struct video_buffer **vbuf,
				    k_timeout_t timeout)
{
	struct video_stm32_dcmi_data *data = dev->data;

	*vbuf = k_fifo_get(&data->fifo_out, timeout);
	if (*vbuf == NULL) {
		return -EAGAIN;
	}

	return 0;
}

static int video_stm32_dcmi_get_caps(const struct device *dev, struct video_caps *caps)
{
	const struct video_stm32_dcmi_config *config = dev->config;

	caps->min_line_count = caps->max_line_count = LINE_COUNT_HEIGHT;

	return video_get_caps(config->sensor_dev, caps);
}

static int video_stm32_dcmi_enum_frmival(const struct device *dev, struct video_frmival_enum *fie)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	int ret;

	ret = video_enum_frmival(config->sensor_dev, fie);
	if (ret < 0) {
		return ret;
	}

	if (fie->type == VIDEO_FRMIVAL_TYPE_DISCRETE) {
		struct video_frmival discrete = fie->discrete;

		fie->type = VIDEO_FRMIVAL_TYPE_STEPWISE;
		fie->stepwise.max = discrete;
		fie->stepwise.min.denominator = discrete.denominator;
		fie->stepwise.min.numerator = discrete.numerator * 4;
		fie->stepwise.step.denominator = discrete.denominator;
		fie->stepwise.step.numerator = discrete.numerator * 2;
	} else {
		fie->stepwise.min.numerator *= 4;
		fie->stepwise.step.numerator *= 2;
	}

	return 0;
}

#define STM32_DCMI_MAX_FRAME_DROP	4
static int video_stm32_dcmi_set_frmival(const struct device *dev, struct video_frmival *frmival)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	struct video_stm32_dcmi_data *data = dev->data;
	struct video_frmival_enum fie = {
		.format = &data->fmt,
	};
	struct video_frmival best_sensor_frmival;
	uint64_t best_diff_nsec = INT32_MAX;
	uint64_t diff_nsec = 0, a, b;
	int best_capture_rate = 1;

	for (int capture_rate = 1; capture_rate <= STM32_DCMI_MAX_FRAME_DROP; capture_rate *= 2) {
		fie.discrete.numerator = frmival->numerator;
		fie.discrete.denominator = frmival->denominator * capture_rate;

		a = video_frmival_nsec(&fie.discrete);
		video_closest_frmival(config->sensor_dev, &fie);
		b = video_frmival_nsec(&fie.discrete);
		diff_nsec = a > b ? a - b : b - a;
		if (diff_nsec < best_diff_nsec) {
			best_diff_nsec = diff_nsec;
			best_sensor_frmival = fie.discrete;
			best_capture_rate = capture_rate;
		}
		if (diff_nsec == 0) {
			break;
		}
	}

	frmival->numerator = best_sensor_frmival.numerator * best_capture_rate;
	frmival->denominator = best_sensor_frmival.denominator;

	data->capture_rate = best_capture_rate;

	return video_set_frmival(config->sensor_dev, &best_sensor_frmival);
}

static int video_stm32_dcmi_get_frmival(const struct device *dev, struct video_frmival *frmival)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	struct video_stm32_dcmi_data *data = dev->data;
	int ret;

	ret = video_get_frmival(config->sensor_dev, frmival);
	if (ret < 0) {
		return ret;
	}

	frmival->numerator *= data->capture_rate;

	return 0;
}

static DEVICE_API(video, video_stm32_dcmi_driver_api) = {
	.set_format = video_stm32_dcmi_set_fmt,
	.get_format = video_stm32_dcmi_get_fmt,
	.set_stream = video_stm32_dcmi_set_stream,
	.enqueue = video_stm32_dcmi_enqueue,
	.dequeue = video_stm32_dcmi_dequeue,
	.get_caps = video_stm32_dcmi_get_caps,
	.enum_frmival = video_stm32_dcmi_enum_frmival,
	.set_frmival = video_stm32_dcmi_set_frmival,
	.get_frmival = video_stm32_dcmi_get_frmival,
};

static void video_stm32_dcmi_irq_config_func(const struct device *dev)
{
	IRQ_CONNECT(DT_INST_IRQN(0), DT_INST_IRQ(0, priority),
		stm32_dcmi_isr, DEVICE_DT_INST_GET(0), 0);
	irq_enable(DT_INST_IRQN(0));
}

#define DCMI_DMA_CHANNEL_INIT(index, src_dev, dest_dev)					\
	.dma_dev = DEVICE_DT_GET(DT_INST_DMAS_CTLR_BY_IDX(index, 0)),			\
	.channel = DT_INST_DMAS_CELL_BY_IDX(index, 0, channel),				\
	.reg = (DMA_TypeDef *)DT_REG_ADDR(						\
				DT_PHANDLE_BY_IDX(DT_DRV_INST(0), dmas, 0)),		\
	.cfg = {									\
		.dma_slot = STM32_DMA_SLOT_BY_IDX(index, 0, slot),			\
		.channel_direction = STM32_DMA_CONFIG_DIRECTION(			\
			STM32_DMA_CHANNEL_CONFIG_BY_IDX(index, 0)),			\
		.source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(		\
			STM32_DMA_CHANNEL_CONFIG_BY_IDX(index, 0)),			\
		.dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(		\
			STM32_DMA_CHANNEL_CONFIG_BY_IDX(index, 0)),			\
		.source_burst_length = 1,						\
		.dest_burst_length = 1,						\
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(				\
			STM32_DMA_CHANNEL_CONFIG_BY_IDX(index, 0)),			\
		.dma_callback = dcmi_dma_callback,					\
	},										\

PINCTRL_DT_INST_DEFINE(0);

#define STM32_DCMI_GET_BUS_WIDTH(bus_width)						\
	((bus_width) == 8 ? DCMI_EXTEND_DATA_8B :					\
	(bus_width) == 10 ? DCMI_EXTEND_DATA_10B :					\
	(bus_width) == 12 ? DCMI_EXTEND_DATA_12B :					\
	(bus_width) == 14 ? DCMI_EXTEND_DATA_14B :					\
	DCMI_EXTEND_DATA_8B)

#define DCMI_DMA_CHANNEL(id, src, dest)							\
	.dma = {									\
		COND_CODE_1(DT_INST_DMAS_HAS_IDX(id, 0),				\
			(DCMI_DMA_CHANNEL_INIT(id, src, dest)),				\
			(NULL))								\
	},

static struct video_stm32_dcmi_data video_stm32_dcmi_data_0 = {
	.hdcmi = {
		.Instance = (DCMI_TypeDef *) DT_INST_REG_ADDR(0),
		.Init = {
				.SynchroMode = DCMI_SYNCHRO_HARDWARE,
				.PCKPolarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(0, 0, 0),
							  pclk_sample, 0) ?
							  DCMI_PCKPOLARITY_RISING :
							  DCMI_PCKPOLARITY_FALLING,
				.HSPolarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(0, 0, 0),
							 hsync_active, 0) ?
							 DCMI_HSPOLARITY_HIGH : DCMI_HSPOLARITY_LOW,
				.VSPolarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(0, 0, 0),
							 vsync_active, 0) ?
							 DCMI_VSPOLARITY_HIGH : DCMI_VSPOLARITY_LOW,
				.ExtendedDataMode = STM32_DCMI_GET_BUS_WIDTH(
							DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(0, 0, 0),
								   bus_width, 8)),
				.JPEGMode = DCMI_JPEG_DISABLE,
				.ByteSelectMode = DCMI_BSM_ALL,
				.ByteSelectStart = DCMI_OEBS_ODD,
				.LineSelectMode = DCMI_LSM_ALL,
				.LineSelectStart = DCMI_OELS_ODD,
		},
	},
};

#define SOURCE_DEV(n) DEVICE_DT_GET(DT_NODE_REMOTE_DEVICE(DT_INST_ENDPOINT_BY_ID(n, 0, 0)))

static const struct video_stm32_dcmi_config video_stm32_dcmi_config_0 = {
	.pclken = {
		.enr = DT_INST_CLOCKS_CELL(0, bits),
		.bus = DT_INST_CLOCKS_CELL(0, bus)
	},
	.irq_config = video_stm32_dcmi_irq_config_func,
	.pctrl = PINCTRL_DT_INST_DEV_CONFIG_GET(0),
	.sensor_dev = SOURCE_DEV(0),
	DCMI_DMA_CHANNEL(0, PERIPHERAL, MEMORY)
};

static int video_stm32_dcmi_init(const struct device *dev)
{
	const struct video_stm32_dcmi_config *config = dev->config;
	struct video_stm32_dcmi_data *data = dev->data;
	int err;

	err = pinctrl_apply_state(config->pctrl, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		LOG_ERR("pinctrl setup failed. Error %d.", err);
		return err;
	}

	err = stm32_dma_init(dev);
	if (err < 0) {
		LOG_ERR("DMA initialization failed.");
		return err;
	}

	err = stm32_dcmi_enable_clock(dev);
	if (err < 0) {
		LOG_ERR("Clock enabling failed.");
		return err;
	}

	data->dev = dev;
	k_fifo_init(&data->fifo_in);
	k_fifo_init(&data->fifo_out);
	data->capture_rate = 1;
#if defined(CONFIG_VIDEO_STM32U5_DCMI_LLI)
	data->capture_uses_lli = false;
#endif

	config->irq_config(dev);

	err = HAL_DCMI_Init(&data->hdcmi);
	if (err != HAL_OK) {
		LOG_ERR("DCMI initialization failed.");
		return -EIO;
	}

	k_sleep(K_MSEC(100));
	LOG_DBG("%s inited", dev->name);

	return 0;
}

DEVICE_DT_INST_DEFINE(0, &video_stm32_dcmi_init,
		    NULL, &video_stm32_dcmi_data_0,
		    &video_stm32_dcmi_config_0,
		    POST_KERNEL, CONFIG_VIDEO_INIT_PRIORITY,
		    &video_stm32_dcmi_driver_api);

VIDEO_DEVICE_DEFINE(dcmi, DEVICE_DT_INST_GET(0), SOURCE_DEV(0));
